# DuplicateFamilyParameterNameWithSharedParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DuplicateFamilyParameterNameWithSharedParameter Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Parameter '[Parameter]' has the same name with an existing shared parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateFamilyParameterNameWithSharedParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateFamilyParameterNameWithSharedParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateFamilyParameterNameWithSharedParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace